app/Controllers/letteradmin.php

    public function index()
    {
        $letter = new letterModel();
        $data['letteres'] = $letter->findAll();
---
SELECT *
FROM `letter`

    public function preview($id)
    {
        $letter = new letterModel();
        $data['letter'] = $letter->where('id', $id)->first();
---
SELECT *
FROM `letter`
WHERE `id` = '1'
 LIMIT 1